src/cf/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>DefinedType.КодСтроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ЗаказыПоставщикам/ManagerModule.bsl
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказПоставщикуТЧТовары.Ссылка.Дата КАК Период,
		                      |	ЗаказПоставщикуТЧТовары.Ссылка КАК Ссылка,
		                      |	ЗаказПоставщикуТЧТовары.ЗаказПоставщику КАК ЗаказПоставщику,
		                      |	ЗаказПоставщикуТЧТовары.Номенклатура КАК Номенклатура,
		                      |	ЗаказПоставщикуТЧТовары.Характеристика КАК Характеристика,
		                      |	ЗаказПоставщикуТЧТовары.КодСтроки КАК КодСтроки,
		                      |	ЗаказПоставщикуТЧТовары.Количество КАК Количество,
		                      |	ВЫРАЗИТЬ(ЗаказПоставщикуТЧТовары.СуммаСНДС * &КурсДокумента КАК ЧИСЛО(15, 2)) КАК Сумма
		                      |ПОМЕСТИТЬ ВТ
		                      |ИЗ
		                      |	Документ.ЗаказПоставщику.ТЧТовары КАК ЗаказПоставщикуТЧТовары
		                      |ГДЕ
		                      |	ЗаказПоставщикуТЧТовары.Ссылка = &Док
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТ.Период КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                      |	ВТ.Ссылка КАК ЗаказПоставщику,
		                      |	ВТ.Номенклатура КАК Номенклатура,
		                      |	ВТ.Характеристика КАК Характеристика,
		                      |	ВТ.КодСтроки КАК КодСтроки,
		                      |	ВТ.Количество КАК Количество,
		                      |	ВТ.Сумма КАК Сумма
		                      |ИЗ
		                      |	ВТ КАК ВТ
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	ВТ.Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		                      |	ВТ.ЗаказПоставщику,
		                      |	ВТ.Номенклатура,
		                      |	ВТ.Характеристика,
		                      |	ВТ.КодСтроки,
		                      |	ЗаказыПоставщикамОстатки.КоличествоОстаток,
		                      |	ЗаказыПоставщикамОстатки.СуммаОстаток
		                      |ИЗ
		                      |	ВТ КАК ВТ
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаОст, ) КАК ЗаказыПоставщикамОстатки
		                      |		ПО ВТ.ЗаказПоставщику = ЗаказыПоставщикамОстатки.ЗаказПоставщику
		                      |			И ВТ.КодСтроки = ЗаказыПоставщикамОстатки.КодСтроки
		                      |ГДЕ
		                      |	ВТ.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		// Заказ в валюте - в регистр в основной валюте по его курсу.
		Запрос.УстановитьПараметр("КурсДокумента", РаботаСВалютами.ВалютаИКурсДокумента(ДокОбъект).Курс);
		Запрос.УстановитьПараметр("ДатаОст", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(ДокОбъект));
		Движения.ЗаказыПоставщикам.Загрузить(Запрос.Выполнить().Выгрузить());	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") и ЗначениеЗаполнено(ДокОбъект.Основание) и ТипЗнч(ДокОбъект.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Если ДокОбъект.Контрагент = Справочники.Контрагенты.Migration тогда Возврат; КонецЕсли;
		// Регистр - в основной валюте: заказ пишет по своему курсу, поступление - по своему (остаток суммы при
		// разных курсах не обнуляется, регистр читают по количествам).
		Курс = РаботаСВалютами.ВалютаИКурсДокумента(ДокОбъект).Курс;
		Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
			НС = Движения.ЗаказыПоставщикам.ДобавитьРасход();
			НС.Период = ДокОбъект.Дата;
			НС.ЗаказПоставщику = ДокОбъект.Основание;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.КодСтроки = Стр.КодСтроки;
			НС.Количество = Стр.Количество;
			НС.Сумма = РаботаСВалютамиКлиентСервер.СуммаРегл(Стр.Сумма, Курс);
		КонецЦикла;	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
		ЗаказПоставщику = РаботаСДокументами.ПолучитьДокументРодительПоТипу(Тип("ДокументСсылка.ЗаказПоставщику"), ДокОбъект.Основание);
		Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда Возврат КонецЕсли;
		Курс = РаботаСВалютами.ВалютаИКурсДокумента(ДокОбъект).Курс;
		Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
			НС = Движения.ЗаказыПоставщикам.ДобавитьРасход();
			НС.Период = ДокОбъект.Дата;
			НС.ЗаказПоставщику = ЗаказПоставщику;
			НС.Номенклатура = Стр.Номенклатура;
			НС.Характеристика = Стр.Характеристика;
			НС.КодСтроки = Стр.КодСтроки;
			НС.Количество = -Стр.Количество;
			НС.Сумма = -РаботаСВалютамиКлиентСервер.СуммаРегл(Стр.Сумма, Курс);
		КонецЦикла;
	КонецЕсли;		
КонецПроцедуры
